In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [5]:
import seaborn as sns

In [6]:
data=[1,2,3,4,5]

In [7]:
data

[1, 2, 3, 4, 5]

In [8]:
df=pd.DataFrame(data)

In [9]:
df

   0
0  1
1  2
2  3
3  4
4  5

In [10]:
df[0]

0    1
1    2
2    3
3    4
4    5
Name: 0, dtype: int64

In [11]:
df[0][2]

3

In [12]:
data1=['Zeyona',94],['Dora',23],['Cherry',24],['Rose',12],['Jack',30]
df=pd.DataFrame(data1)

In [13]:
df

        0   1
0  Zeyona  94
1    Dora  23
2  Cherry  24
3    Rose  12
4    Jack  30

In [14]:
df.iloc[2]

0    Cherry
1        24
Name: 2, dtype: object

In [16]:
df[:][0:2:3]

        0   1
0  Zeyona  94

In [17]:
data1=['Zeyona',94],['Dora',23],['Cherry',24],['Rose',12],['Jack',30]
df=pd.DataFrame(data1,columns=['Name','Age'])

In [18]:
df

     Name  Age
0  Zeyona   94
1    Dora   23
2  Cherry   24
3    Rose   12
4    Jack   30

In [21]:
data2={'Name':['phoebe','monica','joey','rachel','chandler','Ross'],'age':[30,28,31,28,32,33],'dept':['biotech','ece','viscom','architecture','Chemist','IT']}
df=pd.DataFrame(data2,columns=['Name','age','dept'])

In [22]:
data2

{'Name': ['phoebe', 'monica', 'joey', 'rachel', 'chandler', 'Ross'],
 'age': [30, 28, 31, 28, 32, 33],
 'dept': ['biotech', 'ece', 'viscom', 'architecture', 'Chemist', 'IT']}